outils/benchmarks/openfoam-poiseuille-f25/decks/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

solver          incompressibleFluid;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1;
deltaT          1;

writeControl    timeStep;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  16;
writeCompression off;
timeFormat      general;
timePrecision   10;
runTimeModifiable false;

functions
{
    streamwiseMinFlow
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        patch           streamwiseMin;
        operation       sum;
        fields          (phi);
    }

    streamwiseMaxFlow
    {
        $streamwiseMinFlow;
        patch           streamwiseMax;
    }
}
