outils/benchmarks/openfoam-poiseuille-f25/decks/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0                         -@@HALF_HEIGHT@@ 0)
    (@@CHANNEL_LENGTH@@        -@@HALF_HEIGHT@@ 0)
    (@@CHANNEL_LENGTH@@         @@HALF_HEIGHT@@ 0)
    (0                          @@HALF_HEIGHT@@ 0)
    (0                         -@@HALF_HEIGHT@@ @@CHANNEL_DEPTH@@)
    (@@CHANNEL_LENGTH@@        -@@HALF_HEIGHT@@ @@CHANNEL_DEPTH@@)
    (@@CHANNEL_LENGTH@@         @@HALF_HEIGHT@@ @@CHANNEL_DEPTH@@)
    (0                          @@HALF_HEIGHT@@ @@CHANNEL_DEPTH@@)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (@@CELLS_X@@ @@CELLS_Y@@ @@CELLS_Z@@) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    streamwiseMin
    {
        type cyclic;
        neighbourPatch streamwiseMax;
        faces
        (
            (0 3 7 4)
        );
    }

    streamwiseMax
    {
        type cyclic;
        neighbourPatch streamwiseMin;
        faces
        (
            (1 2 6 5)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    upperWall
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);
