outils/benchmarks/openfoam-poiseuille-f25/decks/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

viscosityModel  constant;
nu              [0 2 -1 0 0 0 0] @@KINEMATIC_VISCOSITY@@;
